#include<stdio.h>
main(){
	int arr[9] ={6,2,0,4,9,10,8,3,7};
	for(int i=0;i<9;i++)
	{//排序前arr的值 
		printf("%d,",arr[i]);
	}
	//开始冒泡排序 
	for(int k=0;k<9-1;k++)//此处9-1为循环次数 每次循环将会确认出最大值,判断一共要循环多少次即 循环次数=数组数量-1 
	{
		for(int j=0;j<9-k-1;j++)//比较相邻元素,将较大的向后移动确认最大值 判断一共要比较多少次 
		{//	即比较次数=数组数量-循环次数（从0开始计算）-1 在内部具体计算时采用的是（用到if判断语句） 
			if (arr[j]>arr[j+1])//此处的大小于号决定着这个数列是升序还是降序 
			{//两数交换的常规函数 
			int temp; 
			temp=arr[j];
			arr[j]=arr[j+1];
			arr[j+1]=temp;
			}
	} 
		}	printf("\n"); //使两段打印值从同一行分开 
	for(int i=0;i<9;i++)
	{//排序后arr的值 
		printf("%d,",arr[i]);
	}
		

} 
