//蛇形枚举规律 对角线
/*
1  2  6  7  15 16 28 29 45
3  5  8  14 17 27 30 44
4  9  13 18 26 31 43
10 12 19 25 32 42
11 20 24 33 41
21 23 34 40 
22 35 39
36 38
37 
对角线
1  =1 
5  =1+4				=1+1*4
13 =5(1+4)+8		=1+4+2*4
25 =13(1+4+8)+12	=1+4+8+3*4
41 =25(1+4+8+12)+16 =1+4+8+12+4*4
累加+从0开始的第个的4 注：第n位的值要输入第n-1的位数，因为算至的时候是从0开始计数 
*/ 
#include<stdio.h>
#include<iostream>
using namespace std;
main(){
	int n=20,ans=1;
	for(int i=0;i<=n;i++){
	ans+=i*4;

	}
		printf("%d\n",ans);	 
	
} 
